Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO Yoneda lemma                                                                           :post:
:PROPERTIES:
:TITLE:    Yoneda lemma
:EXPORT_FILE_NAME: yonedalemma.html
:INDEX_DATE: <2019-06-25 Tue>
:END:

For any covariant  K : D → *Sets*  and r ∈ D, there is a bijection
#+BEGIN_SRC haskell
   y  :  Nat(D(r,-), K) ≅ Kr
#+END_SRC
sending any natural transformation α : D(r,-) => K to its image on the
identity, αᵣ(idᵣ).  If we call よ : C -> Cat(Cᵒᵖ, Sets) to the *Yoneda*
*embedding* that sends each object to its representable presheaf, we can
also write
#+BEGIN_SRC haskell
   Nat(よ(r), K) ≅ K r
#+END_SRC

The formulation in terms of ends and coends is often called the
*Ninja Yoneda lemma* (see Loregian's /[[https://arxiv.org/abs/1501.02503][This is the (co)end, my only (co)friend]]/). 
It can be seen as a sort of Dirac's rule for coend calculus.

For any functor K : *Cᵒᵖ* -> *Sets* (any presheaf), we have
#+BEGIN_SRC haskell
  K  ≅  ∀ c ∈ C .  C(c,_) -> K c
  K  ≅  ∃ c ∈ C .  K c × C(_,c)
#+END_SRC

For any functor H : *C* -> *Sets* (any copresheaf), we have
#+BEGIN_SRC haskell
  H  ≅  ∀ c ∈ C .  C(_,c) -> H c 
  H  ≅  ∃ c ∈ C .  H c × C(c,_)
#+END_SRC

