yonedalemma.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-25 Tue 20:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Yoneda lemma</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Yoneda lemma</h1>
<p>
For any covariant  K : D → <b>Sets</b>  and r ∈ D, there is a bijection
</p>
<div class="org-src-container">
<pre class="src src-haskell">   y  <span style="color: #ce537a; font-weight: bold;">:</span>  <span style="color: #ce537a; font-weight: bold;">Nat</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">D</span><span style="color: #bc6ec5;">(</span>r,<span style="color: #7590db;">-</span><span style="color: #bc6ec5;">)</span>, <span style="color: #ce537a; font-weight: bold;">K</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&#8773;</span> <span style="color: #ce537a; font-weight: bold;">Kr</span>
</pre>
</div>
<p>
sending any natural transformation α : D(r,-) =&gt; K to its image on the
identity, αᵣ(idᵣ).  If we call よ : C -&gt; Cat(Cᵒᵖ, Sets) to the <b>Yoneda</b>
<b>embedding</b> that sends each object to its representable presheaf, we can
also write
</p>
<div class="org-src-container">
<pre class="src src-haskell">   <span style="color: #ce537a; font-weight: bold;">Nat</span><span style="color: #4f97d7;">(</span>&#12424;<span style="color: #bc6ec5;">(</span>r<span style="color: #bc6ec5;">)</span>, <span style="color: #ce537a; font-weight: bold;">K</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&#8773;</span> <span style="color: #ce537a; font-weight: bold;">K</span> r
</pre>
</div>

<p>
The formulation in terms of ends and coends is often called the
<b>Ninja Yoneda lemma</b> (see Loregian's <i><a href="https://arxiv.org/abs/1501.02503">This is the (co)end, my only (co)friend</a></i>). 
It can be seen as a sort of Dirac's rule for coend calculus.
</p>

<p>
For any functor K : <b>Cᵒᵖ</b> -&gt; <b>Sets</b> (any presheaf), we have
</p>
<div class="org-src-container">
<pre class="src src-haskell">  <span style="color: #ce537a; font-weight: bold;">K</span>  <span style="color: #7590db;">&#8773;</span>  <span style="color: #7590db;">&#8704;</span> c <span style="color: #7590db;">&#8712;</span> <span style="color: #ce537a; font-weight: bold;">C</span> <span style="color: #7590db;">.</span>  <span style="color: #ce537a; font-weight: bold;">C</span><span style="color: #4f97d7;">(</span>c,<span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">K</span> c
  <span style="color: #ce537a; font-weight: bold;">K</span>  <span style="color: #7590db;">&#8773;</span>  <span style="color: #7590db;">&#8707;</span> c <span style="color: #7590db;">&#8712;</span> <span style="color: #ce537a; font-weight: bold;">C</span> <span style="color: #7590db;">.</span>  <span style="color: #ce537a; font-weight: bold;">K</span> c <span style="color: #7590db;">&#215;</span> <span style="color: #ce537a; font-weight: bold;">C</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">_</span>,c<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
For any functor H : <b>C</b> -&gt; <b>Sets</b> (any copresheaf), we have
</p>
<div class="org-src-container">
<pre class="src src-haskell">  <span style="color: #ce537a; font-weight: bold;">H</span>  <span style="color: #7590db;">&#8773;</span>  <span style="color: #7590db;">&#8704;</span> c <span style="color: #7590db;">&#8712;</span> <span style="color: #ce537a; font-weight: bold;">C</span> <span style="color: #7590db;">.</span>  <span style="color: #ce537a; font-weight: bold;">C</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">_</span>,c<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">H</span> c 
  <span style="color: #ce537a; font-weight: bold;">H</span>  <span style="color: #7590db;">&#8773;</span>  <span style="color: #7590db;">&#8707;</span> c <span style="color: #7590db;">&#8712;</span> <span style="color: #ce537a; font-weight: bold;">C</span> <span style="color: #7590db;">.</span>  <span style="color: #ce537a; font-weight: bold;">H</span> c <span style="color: #7590db;">&#215;</span> <span style="color: #ce537a; font-weight: bold;">C</span><span style="color: #4f97d7;">(</span>c,<span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited . Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
